Repository: saeedtatweer/SMSniper
Catalog: SMSniper/Localizable.xcstrings
Source language: en
Languages: ar, es, fa

source: Advanced
ar: متقدم
es: Avanzado
fa: پیشرفته

# ANYTHING_IN_MESSAGE
source: Any part of the message
ar: أي جزء من الرسالة
es: Todo el mensaje
fa: هر بخشی از پیام

source: Apps
ar: التطبيقات
es: Aplicaciones

source: Ask anything!
ar: اسأل أي شيء!
es: Preguntame!
fa: هر چه می‌خواهید بپرسید!

# BUTTON_TUTORIAL_FIRST_LAUNCH_TEXT
source: Take me to Settings!
ar: خذني إلى الإعدادات!
es: Llévame a Ajustes!
fa: رفتن به تنظیمات

# BUTTON_TUTORIAL_HELP_TEXT
source: Got it!
ar: فهمت!
es: Hecho!
fa: متوجه شدم!

source: Cancel
ar: إلغاء
es: Cancelar
fa: انصراف

source: enable SMS filtering
ar: لتمكين تصفية الرسائل النصية
es: configurar el filtrado SMS
fa: فعال‌سازی فیلتر کردن پیامک

source: Error
ar: خطأ
fa: خطا

source: Exact match
ar: مطابق تماماً
es: Ocurrencia Exacta
fa: تطابق کامل

# EXACT_MATCH_CAPTION
source: Classify messages only when the sender/message exactly matches specified term.
ar: لا تتم تصفية الرسائل إلا عندما يكون المرسل/الرسالة مطابقةً تماماً للكلمة أو العبارة المقدمة.
es: Clasifica los mensajes solo cuando el remitente/mensaje es exactamente igual a la palabra o frase especificada arriba.
fa: فیلتر کردن پیام‌ها فقط در صورتی که فرستنده یا پیام با کلمه یا عبارت تعیین شده تطابق کامل داشته باشد.

# FILTER_ACTION_LABEL
source: Label
ar: وسم
es: Etiqueta
fa: برچسب گذاری

# FILTER_CONTAINS_TEXT_LABEL
source: Contains
ar: تحتوي
es: Contenga
fa: شامل

# FILTER_TEXT_PLACEHOLDER
source: Enter a word or phrase
ar: أدخل كلمة أو عبارة
es: Ingresa una palabra o frase
fa: یک کلمه یا عبارت وارد کنید

# FILTER_TYPE_SELECTION_LABEL
source: When
ar: عندما
es: Cuando
fa: اگر

source: General
ar: عام
fa: عمومی

source: Help
ar: مساعدة
es: Ayuda
fa: راهنما

# IMPORT_ERROR %@
source: There was an error importing the selected file. %@
ar: حدث خطأ أثناء استيراد الملف المحدد. %@
es: Ocurrió un error al importar el archivo seleccionado. %@
fa: خطا در وارد کردن فایل انتخاب شده. %@

# IS_CASE_SENSITIVE
source: Case sensitive
ar: هل حساس لحالة الأحرف
es: Sensible a mayúsculas
fa: حساس به حروف بزرگ/کوچک

# IS_CASE_SENSITIVE_DETAIL
source: Enable this option to treat uppercase and lowercase characters differently.
ar: تمكين هذا الخيار لمعاملة الأحرف الكبيرة والصغيرة بشكل مختلف
es: Active esta opción para tratar los caracteres en mayúscula y minúscula de manera diferente.
fa: فعال‌سازی این گزینه برای برخورد با حروف بزرگ و کوچک به صورت متفاوت

# JUNK_ACTION
source: Junk
ar: الرسائل المزعجة
es: Spam
fa: اسپم

# MESSAGES_APP
source: 'Messages'
ar: 'الرسائل'
es: 'Mensajes'
fa: پیام‌ها

source: Need help?
ar: هل تحتاج إلى مساعدة؟
es: Necesitas ayuda?
fa: به کمک نیاز دارید؟

# NO_EMAIL_CONFIGURED
source: It seems you don't have an email account set up. You can write me directly at support@statweer.com
ar: يبدو أنه لم يتم تعيين حساب بريد إلكتروني على جهازك. يمكنك الكتابة لي مباشرة على support@statweer.com
es: Parece que no tienes una cuenta de correo configurada en tu iPhone. Puedes escribirnos a support@statweer.com
fa: دستگاه شما برای ارسال ایمیل آماده نیست. می‌توانید مستقیماً با ما از طریق آدرس support@statweer.com در ارتباط باشید.

source: on your iPhone:
ar: على جهاز iPhone الخاص بك:
es: en tu iPhone:
fa: در آیفون شما:

# OPEN_SPACE
source: Open
ar: فتح
es: Abre
fa: باز کردن

# PROMOTION_ACTION
source: Other Promotions
ar: عروض ترويجية أخرى
es: Otras Promociones
fa: تبلیغات دیگر

# PROMOTION_ACTION_COUPONS
source: Coupons
ar: الكوبونات
es: Cupones
fa: کوپن‌ها

# PROMOTION_ACTION_OFFERS
source: Offers
ar: العروض
es: Ofertas
fa: پیشنهادها

# SAFE_ACTION
source: Safe (Allow)
ar: آمن (السماح)
es: Seguro (No filtrar)
fa: امن (مجاز)

source: Save
ar: حفظ
es: Guardar
fa: ذخیره

source: Select All
ar: تحديد الكل
es: Seleccionar Todos
fa: انتخاب همه

source: Select New
ar: تحديد الجديد
es: Seleccionar Nuevos
fa: انتخاب جدید

source: Select None
ar: عدم تحديد أي شيء
es: Limpiar Selección
fa: عدم انتخاب

# SENDER_NUMBER
source: Sender Name or Number
ar: اسم أو رقم المرسل
es: Remitente o número
fa: شماره یا نام فرستنده

source: 'Settings' app
ar: تطبيق 'الإعدادات'
es: 'Preferencias'
fa: Settings

# SETUP_INFO
source: Enable SMS filtering
ar: تمكين تصفية الرسائل النصية
fa: گزینه SMS Filtering را فعال کنید

source: Tap
ar: اضغط
es: Toca
fa: انتخاب

# TAP_SPACE
source: Tap '
ar: اضغط '
es: Toca '
fa: با لمس

# TEXT
source: Message Text
ar: نص الرسالة
es: Mensaje
fa: متن پیام

source: Toggle
ar: بدّل
es: Activa
fa: تغییر وضعیت

# TRANSACTION_ACTION
source: Other Transactions
ar: معاملات أخرى
es: Otras Transacciones
fa: تراکنش‌های دیگر

# TRANSACTION_ACTION_FINANCE
source: Finance
ar: الماليه
es: Finanzas
fa: مالی

# TRANSACTION_ACTION_ORDERS
source: Orders
ar: اوامر
es: Pedidos
fa: سفارش‌ها

# TRANSACTION_ACTION_REMINDERS
source: Reminders
ar: رسائل التذكير
es: Recordatorios
fa: یادآورها

# UNKNOWN_SOURCES
source: 'Unknown and Spam'
ar: 'غير معروف ومزعج'
es: 'Desconocidos y No deseado'

# USE_REGULAR_EXPRESSIONS
source: Match as Regular Expression
ar: مطابقة كتعبير نمطي
es: Filtrar como Expresión Regular
fa: تطابق به عنوان Regex

# WELCOME_SUBTITLE
source: Welcome to SMSniper
ar: مرحباً بك في SMSniper
es: Bienvenid@ a SMSniper!
fa: به SMSniper خوش آمدید

# WELCOME_TITLE
source: Hello there!
ar: مرحباً!
es: Hola!
fa: سلام!

# DUPLICATE_FILTERS
source: Duplicate Rules
es: Reglas Duplicadas
fa: تکرار فیلترها

# EMPTY_IMPORT_FILE
source: The file you selected contained no rules.
es: El archivo seleccionado no contiene reglas.
fa: فایلی که انتخاب کرده‌اید، شامل هیچ فیلتری نیست.

# EMPTY_LIST_ALLOW_MESSAGE
source: Use Safe rules to make sure important SMS messages are always delivered to your inbox.
es: Utiliza las reglas seguras para que tus mensajes SMS importantes siempre se entreguen en tu bandeja de entrada.
fa: از فیلترهای امن به این منظور استفاده کنید که پیام‌ها حتماً به صندوق اصلی برسند.

# EMPTY_LIST_ALLOW_TITLE
source: Your Safe rule list is empty
es: No tienes reglas de entrega segura
fa: فهرست فیلترهای امن خالی است

# EMPTY_LIST_JUNK_MESSAGE
source: Use junk rules to block SMS from unknown senders. You will not get notifications from junk messages
es: SMSniper bloqueará los mensajes SMS de desconocidos usando las reglas que agregues aquí. No recibirás notificaciones para mensajes SPAM
fa: از فیلترهای اسپم برای مسدود کردن پیام‌ها از فرستنده‌های ناشناس استفاده کنید. برای این پیام‌ها هشدار دریافت نخواهید کرد.

# EMPTY_LIST_JUNK_TITLE
source: Your Junk rule list is empty
es: No tienes reglas de SPAM
fa: فهرست فیلترهای اسپم خالی است

# EMPTY_LIST_OTHER_MESSAGE
source: Use category rules to classify SMS messages out of your inbox, but still get notifications.
es: Utiliza diferentes categorías para archivar tus mensajes SMS, pero aún recibir notificaciones.
fa: از فیلترهای دسته‌بندی برای قرار دادن پیامک‌ها بیرون از صندوق اصلی استفاده کنید. برای این پیام‌ها همچنان هشدار دریافت خواهید کرد.

# EMPTY_LIST_OTHER_TITLE
source: Your Category rule list is empty
es: No tienes reglas de categoria
fa: فهرست فیلترهای دسته‌بندی خالی است

# EXPORT_BLOCK_LIST
source: Export Rule List
es: Exportar Lista de reglas
fa: خروجی گرفتن از فهرست فیلترها

# FILTER_ADD_VIEW_TITLE
source: Add Rule
es: Add Regla
fa: افزودن فیلتر

# FILTER_EDIT_VIEW_TITLE
source: Update Rule
es: Actualizar Regla
fa: به روز رسانی فیلتر

# FILTER_INFORMATION
source: Rule settings
es: Información de la regla
fa: تنظیمات فیلتر

# HERE_IS_HOW
source: To
es: Para
fa: برای

# IMPORT_BLOCK_LIST
source: Import Rule List
es: Importar Lista de reglas
fa: وارد کردن فهرست فیلترها

# INCORRECT_FILE_FORMAT
source: The JSON file does not appear to have the right format or is incompatible
es: El archivo JSON no tiene el formato correcto o es incompatible.
fa: فایل JSON ساختار مناسب ندارد

source: Let's
es: Vamos a
fa: بریم برای

# LIST_VIEW_TITLE
source: Rules
es: Reglas
fa: فیلترها

# NEW_FILTER
source: New Rule
es: Nueva Regla
fa: فیلتر جدید

# NEW_FILTERS
source: New Rules
es: Reglas Nuevas
fa: فیلترهای جدید

source: Promotions
es: Promociones
fa: تبلیغات

# THE_APP
source: the
es: la aplicación

# TO_ADD_A_FILTER_SPACE
source: ' to add a rule.
es: ' para agregar una regla.
fa: یک فیلتر جدید بسازید.

source: Transactions
es: Transacciones
fa: تراکنش‌ها

# UPDATE_FILTER
source: Update Rule
es: Editar Regla
fa: به روز رسانی فیلتر

# USE_REGULAR_EXPRESSIONS_DETAIL
source: Enable this option if your rule contains a regular expression. (Regex should be provided in PCRE format).
es: Activa esta opción si tu regla contiene una Expresión Regular (Regex). (Las expresiones regulares deben usar el formato PCRE).
fa: اگر فیلتر شامل عبارات منظم (Regex) است، این گزینه را روشن کنید. عبارات منظم باید منطبق بر ساختار PCRE باشند.

source: Ok
fa: بسیار خوب
